PG4/NdhkApiGatewayTestScripts/TestScripts/PG_loadTest_command_check.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.1.1 r1855137">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="NTTdata" enabled="true">
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.tearDown_on_shutdown">true</boolProp>
      <boolProp name="TestPlan.serialize_threadgroups">true</boolProp>
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
        <collectionProp name="Arguments.arguments"/>
      </elementProp>
    </TestPlan>
    <hashTree>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="Thread Group" enabled="true">
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller" enabled="true">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <stringProp name="LoopController.loops">${__P(cycle,-1)}</stringProp>
        </elementProp>
        <stringProp name="ThreadGroup.num_threads">${__P(threadnum,2)}</stringProp>
        <stringProp name="ThreadGroup.ramp_time">${__P(rampuptime,2)}</stringProp>
        <boolProp name="ThreadGroup.scheduler">true</boolProp>
        <stringProp name="ThreadGroup.duration">${__P(duration,60)}</stringProp>
      </ThreadGroup>
      <hashTree>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="paygent" enabled="true">
          <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments">
              <elementProp name="" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.value">{&#xd;
    &quot;login&quot;: &quot;BANDAI&quot;,&#xd;
    &quot;pass&quot;: &quot;Bandai@123&quot;,&#xd;
    &quot;amt&quot;: &quot;100&quot;,&#xd;
    &quot;txnid&quot;: &quot;xqy8922&quot;,&#xd;
    &quot;signature&quot;: &quot;70c90b1d14c34a509fc36721950c8600a61af80abb5facced267caa4c1b85c597f07f4acaeeec9a5fd45347b5862013abcf91b8d7da7661d7eb4558aa8fc36c0&quot;,&#xd;
    &quot;txncurr&quot;: &quot;TWD&quot;,&#xd;
    &quot;customerDetails&quot;: {&#xd;
        &quot;name&quot;: &quot;Test-User&quot;,&#xd;
        &quot;phone&quot;: &quot;123-0123456785&quot;,&#xd;
        &quot;email&quot;: &quot;test@nttdata.com&quot;&#xd;
    },&#xd;
    &quot;carddata&quot;: &quot;Pp40Rg5Z1MLfDOGiMxsS5hXKcDgKLuRJIZJLhOuhDmw=|CardHolder|CC|VISA&quot;,&#xd;
    &quot;channelType&quot;: &quot;neweb&quot;,&#xd;
    &quot;paymentMethod&quot;: &quot;credit&quot;,&#xd;
    &quot;manualCapture&quot;: &quot;N&quot;,&#xd;
    &quot;authentication&quot;: &quot;N&quot;,&#xd;
    &quot;callbackUrl&quot;: &quot;https://script.google.com/macros/s/AKfycbwRpCfYEQiDPGvCdE_mJXPWa9z42oSquQ4Ua5jQjd9B_k-L1wA/exec&quot;,&#xd;
    &quot;ru&quot;: &quot;https://uat.ndhkpay.com/NTT_Pages/return&quot;,&#xd;
    &quot;remarks&quot;: &quot;nttuattesting&quot;,&#xd;
    &quot;od&quot;: &quot;od-migs&quot;,&#xd;
    &quot;udf1&quot;: &quot;HIVE&quot;,&#xd;
    &quot;udf2&quot;: &quot;PIG&quot;,&#xd;
    &quot;udf3&quot;: &quot;SPARK&quot;,&#xd;
    &quot;udf4&quot;: &quot;MAP-REDUCE&quot;,&#xd;
    &quot;udf5&quot;: &quot;YARN&quot;&#xd;
}</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
          <stringProp name="HTTPSampler.domain">sit.ndhkpay.com</stringProp>
          <stringProp name="HTTPSampler.protocol">https</stringProp>
          <stringProp name="HTTPSampler.path">/Ndhk_Api/paymentRequest</stringProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
        </HTTPSamplerProxy>
        <hashTree>
          <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="Response Assertion" enabled="true">
            <collectionProp name="Asserion.test_strings">
              <stringProp name="1697144617">&quot;respcode&quot;:&quot;02&quot;,&quot;respdesc&quot;:&quot;pending&quot;</stringProp>
            </collectionProp>
            <stringProp name="Assertion.test_field">Assertion.response_data</stringProp>
            <boolProp name="Assertion.assume_success">false</boolProp>
            <intProp name="Assertion.test_type">2</intProp>
          </ResponseAssertion>
          <hashTree/>
        </hashTree>
        <ResultCollector guiclass="StatVisualizer" testclass="ResultCollector" testname="Aggregate Report" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
          <boolProp name="useGroupName">true</boolProp>
        </ResultCollector>
        <hashTree/>
        <ResultCollector guiclass="ViewResultsFullVisualizer" testclass="ResultCollector" testname="View Results Tree" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>
        <ResultCollector guiclass="StatGraphVisualizer" testclass="ResultCollector" testname="Aggregate Graph" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>
        <ResultCollector guiclass="SummaryReport" testclass="ResultCollector" testname="Summary Report" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>
      </hashTree>
    </hashTree>
  </hashTree>
</jmeterTestPlan>